<template>

    <Head>
        <title>عبر - إتفاقية المستخدم</title>
    </Head>


    <main class="min-h-screen outline-none">

        <section class="relative isolate px-4 pt-14 xs:px-6 lg:px-8">
            <div class="absolute inset-x-0 -top-40 -z-10 transform-gpu overflow-hidden blur-3xl sm:-top-80"
                aria-hidden="true">
                <div class="relative left-[calc(50%-11rem)] aspect-[1155/678] w-[36.125rem] -translate-x-1/2 rotate-[30deg] bg-gradient-to-tr from-[#ff80b5] to-[#9089fc] opacity-30 sm:left-[calc(50%-30rem)] sm:w-[72.1875rem]"
                    style="
                        clip-path: polygon(
                            74.1% 44.1%,
                            100% 61.6%,
                            97.5% 26.9%,
                            85.5% 0.1%,
                            80.7% 2%,
                            72.5% 32.5%,
                            60.2% 62.4%,
                            52.4% 68.1%,
                            47.5% 58.3%,
                            45.2% 34.5%,
                            27.5% 76.7%,
                            0.1% 64.9%,
                            17.9% 100%,
                            27.6% 76.8%,
                            76.1% 97.7%,
                            74.1% 44.1%
                        );
                    "></div>
            </div>
            <div class="absolute inset-x-0 top-[calc(100%-13rem)] -z-10 transform-gpu overflow-hidden blur-3xl sm:top-[calc(100%-30rem)]"
                aria-hidden="true">
                <div class="relative left-[calc(50%+3rem)] aspect-[1155/678] w-[36.125rem] -translate-x-1/2 bg-gradient-to-tr from-[#ff80b5] to-[#9089fc] opacity-30 sm:left-[calc(50%+36rem)] sm:w-[72.1875rem]"
                    style="
                        clip-path: polygon(
                            74.1% 44.1%,
                            100% 61.6%,
                            97.5% 26.9%,
                            85.5% 0.1%,
                            80.7% 2%,
                            72.5% 32.5%,
                            60.2% 62.4%,
                            52.4% 68.1%,
                            47.5% 58.3%,
                            45.2% 34.5%,
                            27.5% 76.7%,
                            0.1% 64.9%,
                            17.9% 100%,
                            27.6% 76.8%,
                            76.1% 97.7%,
                            74.1% 44.1%
                        );
                    "></div>
            </div>
        </section>


        <section
            class="relative mx-auto flex w-full max-w-4xl flex-col items-center px-4 pb-36 pt-28 xs:px-6 md:pt-32 lg:px-8 xl:pb-44 content">
            <div class="rounded-md border border-gray-300 px-3 py-3 shadow-sm">
                <!-- Heroicon name: outline/identification -->
                <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" stroke-width="1.5"
                    stroke="currentColor" height="24" width="24">
                    <path stroke-linecap="round" stroke-linejoin="round"
                        d="M15 9h3.75M15 12h3.75M15 15h3.75M4.5 19.5h15a2.25 2.25 0 0 0 2.25-2.25V6.75A2.25 2.25 0 0 0 19.5 4.5h-15a2.25 2.25 0 0 0-2.25 2.25v10.5A2.25 2.25 0 0 0 4.5 19.5Zm6-10.125a1.875 1.875 0 1 1-3.75 0 1.875 1.875 0 0 1 3.75 0Zm1.294 6.336a6.721 6.721 0 0 1-3.17.789 6.721 6.721 0 0 1-3.168-.789 3.376 3.376 0 0 1 6.338 0Z">
                    </path>
                </svg>
            </div>
            <h1 class="pt-8 text-lg font-semibold xs:text-xl 2xl:text-2xl">إتفاقية المستخدم</h1>
            <div class="pt-16 prose prose-sm prose-gray lg:prose-base">
              <h2>اتفاقية تسجيل معبَّر على منصة عبَّر</h2>
              <p>تشكل هذه الأحكام والشروط اتفاقية ملزمة بين كل من شركة سمو لتقنية المعلومات بصفتها المشغله لمنصة عبَّر Abber، شركة سعودية، سجل تجاري رقم () (ويشار إليها فيما بـــ "عبَّر")، وبين المعبَّر الراغب في التعبير في تعبير الرؤى على منصة عبَّر (ويشار إليهـ/ا فيما بعد بـــ"المعبَّر"). ويقرّ المعبَّر بعلمه بأنه بمجرد النقر على زر الموافقة أو توقيعه إلكترونياً على هذه الاتفاقية فإنها تعتبر ملزمة وقابلة للتنفيذ ويتعهد بالالتزام بكل ما ورد فيها.</p>
              <h3>نطاق الاتفاقية وطبيعة العلاقة</h3>
              <p>تتضمن هذه الاتفاقية الأحكام والشروط التي تنظم العلاقة بين عبَّر والمعبَّر فيما يتعلق بتسجيل المعبَّر للمشاركة في تعبير الرؤى التي تطرح من خلال منصة عبَّر ، ولاتعتبر بأي حال من الأحوال اتفاقية شراكة أو وكالة أو مقاولة أو توظيف. ويعلم المعبَّر بأن التعبير في تعبير الرؤى سيخضع إلى اتفاقيات وأحكام وشروط خاصة بكل عملية، وتكون الاحكام الواردة في هذه الاتفاقية مكملة لها وسيشار إليها في الاتفاقيات اللاحقة بــــ "اتفاقية تسجيل المعبَّر".</p>
              <h3>منصة عبَّر</h3>
              <p>يقر المعبَّر بعلمه بأن عبَّر هي منصة إلكترونية تقدم خدمة الوساطة والترتيب بين المعبَّرين المسجلين فيها والراغبين في الحصول على خدمات تعبير الرؤى -من خلال المنصة، وأن الموقع لا يتحمل أي مسئولية قانونية ناشئة عن أي أخطاء في تقديم الخدمة سواء كانت أخطاء تقنية أو أخطاء في عرض البيانات والمعلومات التي تحدث من غير قصد وخارجة عن إرادة الموقع.</p>
              <h3>التسجيل كمعبَّر</h3>
              <p>لغايات الحصول على حق تعبير الرؤى الموجودة على المنصة ("حق التعبير") فإن المعبَّر يجب أن يكون مسجلاً ومقبولاً وفق المعايير التي تحددها عبَّر، ويتم تقديم المستندات والمعلومات وفق النموذج الالكتروني المعتمد على المنصة، ولعبَّر حق طلب معلومات أو مستندات إضافية وفقاً لتقديرها المطلق.</p>
              <p>لغايات الحصول على حق تعبير الرؤى الموجودة على المنصة ("حق التعبير") فإن المعبَّر يجب أن يكون مسجلاً ومقبولاً وفق المعايير التي تحددها عبَّر، ويتم تقديم المستندات والمعلومات وفق النموذج الالكتروني المعتمد على المنصة، ولعبَّر حق طلب معلومات أو مستندات إضافية وفقاً لتقديرها المطلق.</p>
              <p>ويدرك المعبَّر إن استكمال إجراءات التسجيل لايعني حصوله بشكل تلقائي على حق التعبير، ويتوقف منح هذا الحق على التقدير المطلق لعبَّر، ولعبَّر حق رفض منحه دون الحاجة إلى تسبيب قرارها، وليس للمعبَّر حق الاعتراض أو المطالبة بأية تعويضات عن ذلك.</p>
              <h3>التحقق من شخصية المعبَّر</h3>
              <p>تسعى عبَّر إلى توفير بيئة آمنة إضافة إلى التزامها بسياسات توفير معبَّرين على درجة عالية من الثقة والعلم بشؤون تعبير الرؤى، وعلى هذا يوافق المعبَّر بموجب هذه الاتفاقية على السماح لمنصة عبَّر بالسؤال والتحقق اللازمين للتثبت من هوية المعبَّر، وقد يشمل ذلك، جمع المعلومات بالوسائل المختلفة، كما لها حق الاتصال بمن ترى للسؤال عن شخصية المعبَّر.</p>
              <p>ويعلم المعبَّر بأنه رغم أن عبَّر تبذل قصارى الجهد لإنهاء عمليات السؤال والتحقق خلال مدة لاتتجاوز ثلاثة أيام عمل من تاريخ تقديم الطلب، إلا أن عبَّر لاتضمن أن عملية التسجيل ومنح حق التعبير سيتم خلال المدة المذكورة، لذلك لا تتحمل عبَّر أية مسؤولية عن تأخر العملية.</p>
              <h3>إلغاء التسجيل وحق التعبير</h3>
              <p>يدرك المعبَّر أن استمرار التسجيل في المنصة والتمتع بحق التعبير يتوقف على احتفاظ المعبَّر دائماً بالمستوى المطلوب من المتطلبات التي تقررها عبَّر وأية تعديلات تطرأ عليها من وقت لآخر، ولعبَّر حق إلغاء تسجيل المعبَّر أو تعليقه وفقاً لتقديرها المطلق ودون الحاجة إلى تبرير قرارها. ويقر المعبَّر بحق عبَّر بتعديل معايير التسجيل والتعبير ومتطلباتها المستمرة بإرادتها المنفردة. وفي كل الأحوال، فإن لعبَّر حق إلغاء تسجيل المعبَّر إذا ثبت في أي وقت أن التسجيل تم استناداً إلى معلومات مظللة أو غير حقيقية.</p>
              <h3>علاقة المعبَّر بمنصة عبَّر</h3>
              <p>تكون العلاقة بين عبَّر والمعبَّر علاقة تقديم خدمة ووكالة بأجر، حيث تقدم عبَّر خدماتها الالكترونية في الترتيب والتوسط بين طالبي الرؤى والمعبَّرين، وتتولى نيابة عن الأطراف بعض المهام لإتمام العملية بينهما. ولاتعتبر عبَّر شريكاً للمعبَّرين، ولاضامنة لهم ، ولا جهة تنظيمية لهم ولاتملك عبَّر أي صفة إشرافية عليهم.</p>
            </div>
        </section>

    </main>
</template>

<script setup lang="ts">
definePageMeta({
    auth: false
})
</script>

<style>
/* .content p:first-child {
    @apply text-4xl my-8 font-bold
}

.content p {
    @apply text-center
}



.content h2 {
    @apply lg:text-2xl text-xl my-2 font-semibold
}

.content h3 {
    @apply lg:text-xl text-lg my-6 font-bold
}


.content img {
    @apply rounded-xl my-2
}

.content p {
    @apply my-4 text-xl
} */
</style>